In [1]:
import sqlalchemy as db
import getpass

In [2]:
user = "root"
password = getpass.getpass("Insert password: ")
connectionURI = f"mysql+pymysql://{user}:{password}@localhost/publications"

Insert password: ········

In [3]:
engine = db.create_engine(connectionURI)
print("Connected to server!")

Connected to server!

In [4]:
import pandas as pd

In [8]:
#Challenge 1
df = pd.read_sql_query("""
SELECT au_id AS `Author ID`, (`aggregated_royalties`+`advance`) AS Profits
FROM
(SELECT au_id, title_id, SUM(sales_royalty) AS `aggregated_royalties` , `advance`
FROM
(SELECT titleauthor.au_id, titleauthor.title_id , (titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS sales_royalty, titles.advance AS `advance`
FROM titleauthor
LEFT JOIN titles
	ON titleauthor.title_id=titles.title_id
LEFT JOIN sales
	ON titleauthor.title_id=sales.title_id) as s
GROUP BY au_id, title_id) as a
ORDER BY Profits DESC
LIMIT 3;
""",engine)
df

     Author ID    Profits
0  722-51-5454  15021.528
1  899-46-2035  15007.176
2  213-46-8915  10150.116

In [ ]:
#Challenge 2
df = pd.read_sql_query("""